In [16]:
import pymysql
import sqlalchemy as alch # python -m pip install --upgrade 'sqlalchemy<2.0'
from getpass import getpass
import pandas as pd

In [20]:
password = getpass()

········

In [21]:
dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [22]:
query = "SELECT * FROM rental;"

pd.read_sql_query(query, engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2023-10-25 16:24:30,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2023-10-25 16:24:30,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2023-10-25 16:24:30,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2023-10-25 16:24:30,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2023-10-25 16:24:30,workday
...,...,...,...,...,...,...,...,...
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2023-10-25 16:24:30,workday
16044,16050,2023-10-25 18:25:18,8,130,NaT,1,2023-10-25 18:25:18,None
16045,16051,2023-10-25 18:25:27,9,130,NaT,1,2023-10-25 18:25:27,None
16046,16052,2023-10-25 18:26:20,9,130,NaT,1,2023-10-25 18:26:20,None
16047,16053,2023-10-25 18:31:08,9,130,NaT,1,2023-10-25 18:31:08,None

### 1. Calculate the average rental duration (in days) for each film:

```sql
-- Your code down below
SELECT...
```

In [23]:
query1 = """
select title, rental_duration, avg(rental_duration) over () as avg_rental_duration from film;
"""

pd.read_sql_query(query1, engine)

                 title  rental_duration  avg_rental_duration
0     ACADEMY DINOSAUR                6                4.985
1       ACE GOLDFINGER                3                4.985
2     ADAPTATION HOLES                7                4.985
3     AFFAIR PREJUDICE                5                4.985
4          AFRICAN EGG                6                4.985
..                 ...              ...                  ...
995     YOUNG LANGUAGE                6                4.985
996         YOUTH KICK                4                4.985
997       ZHIVAGO CORE                6                4.985
998  ZOOLANDER FICTION                5                4.985
999          ZORRO ARK                3                4.985

[1000 rows x 3 columns]

#### Expected output

|title|rental_duration|avg_rental_duration|
|-----|---------------|-------------------|
|ACADEMY DINOSAUR|6              |4.9850             |
|ACE GOLDFINGER|3              |4.9850             |
|ADAPTATION HOLES|7              |4.9850             |
|AFFAIR PREJUDICE|5              |4.9850             |
|AFRICAN EGG|6              |4.9850             |
|AGENT TRUMAN|3              |4.9850             |
|AIRPLANE SIERRA|6              |4.9850             |
|AIRPORT POLLOCK|6              |4.9850             |
|ALABAMA DEVIL|3              |4.9850             |
|ALADDIN CALENDAR|6              |4.9850             |
|ALAMO VIDEOTAPE|6              |4.9850             |
|ALASKA PHANTOM|6              |4.9850             |
|ALI FOREVER|4              |4.9850             |
|ALICE FANTASIA|6              |4.9850             |

###  2. Calculate the average payment amount for each staff member:

In [25]:
query2 = """
select staff.staff_id, avg(amount) over () as amount from staff
join payment on staff.staff_id = payment.staff_id; 
"""

pd.read_sql_query(query2, engine)

       staff_id    amount
0             1  4.200667
1             1  4.200667
2             1  4.200667
3             1  4.200667
4             1  4.200667
...         ...       ...
16044         2  4.200667
16045         2  4.200667
16046         2  4.200667
16047         2  4.200667
16048         2  4.200667

[16049 rows x 2 columns]

#### Expected output

|staff_id|avg_payment_amount|
|--------|------------------|
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |

### 3. Calculate the total revenue for each customer, showing the running total within each customer's rental history:

```sql
-- Your code down below
SELECT...
```

In [26]:
query3 = """
select customer.customer_id, rental.rental_id, rental.rental_date, payment.amount, 
 SUM(payment.amount) OVER (partition by customer.customer_id ORDER BY rental_date) AS running_total
 from customer join rental on customer.customer_id = rental.customer_id
 join payment on rental.rental_id = payment.rental_id
 order by customer.customer_id;
"""

pd.read_sql_query(query3, engine)

       customer_id  rental_id         rental_date  amount  running_total
0                1         76 2005-05-25 11:30:37    2.99           2.99
1                1        573 2005-05-28 10:35:23    0.99           3.98
2                1       1185 2005-06-15 00:54:12    5.99           9.97
3                1       1422 2005-06-15 18:02:53    0.99          10.96
4                1       1476 2005-06-15 21:08:46    9.99          20.95
...            ...        ...                 ...     ...            ...
15635          599      14599 2005-08-21 17:43:42    4.99          66.85
15636          599      14719 2005-08-21 21:41:57    1.99          68.84
15637          599      15590 2005-08-23 06:09:44    8.99          77.83
15638          599      15719 2005-08-23 11:08:46    2.99          80.82
15639          599      15725 2005-08-23 11:25:00    2.99          83.81

[15640 rows x 5 columns]

#### Expected output

|customer_id|rental_id|rental_date        |amount|running_total|
|-----------|---------|-------------------|------|-------------|
|1          |76       |2005-05-25 11:30:37|2.99  |2.99         |
|1          |573      |2005-05-28 10:35:23|0.99  |3.98         |
|1          |1185     |2005-06-15 00:54:12|5.99  |9.97         |
|1          |1422     |2005-06-15 18:02:53|0.99  |10.96        |
|1          |1476     |2005-06-15 21:08:46|9.99  |20.95        |
|1          |1725     |2005-06-16 15:18:57|4.99  |25.94        |
|1          |2308     |2005-06-18 08:41:48|4.99  |30.93        |
|1          |2363     |2005-06-18 13:33:59|0.99  |31.92        |
|1          |3284     |2005-06-21 06:24:45|3.99  |35.91        |
|1          |4526     |2005-07-08 03:17:05|5.99  |41.90        |

### 4. Determine the quartile for the rental rates of films:

```sql
-- Your code down below
SELECT...
```

In [33]:
query4 = """
select title, rental_rate, ntile(4) OVER(PARTITION BY rental_rate) as quartile
from film
order by rental_rate ASC;
"""

pd.read_sql_query(query4, engine)

                    title  rental_rate  quartile
0        ACADEMY DINOSAUR         0.99         1
1         ALAMO VIDEOTAPE         0.99         1
2          ALASKA PHANTOM         0.99         1
3          ALICE FANTASIA         0.99         1
4              ALONE TRIP         0.99         1
..                    ...          ...       ...
995  WONDERLAND CHRISTMAS         4.99         4
996   WORKING MICROCOSMOS         4.99         4
997         WYOMING STORM         4.99         4
998           YENTL IDAHO         4.99         4
999             ZORRO ARK         4.99         4

[1000 rows x 3 columns]

#### Expected output

|title|rental_rate|quartile           |
|-----|-----------|-------------------|
|ACADEMY DINOSAUR|0.99       |1                  |
|ALAMO VIDEOTAPE|0.99       |1                  |
|ALASKA PHANTOM|0.99       |1                  |
|ALICE FANTASIA|0.99       |1                  |
|ALONE TRIP|0.99       |1                  |
|ALTER VICTORY|0.99       |1                  |
|AMADEUS HOLY|0.99       |1                  |
|ANACONDA CONFESSIONS|0.99       |1                  |
|ANNIE IDENTITY|0.99       |1                  |
|ANONYMOUS HUMAN|0.99       |1                  |

### 5. Determine the first and last rental date for each customer:

```sql
-- Your code down below
SELECT...
```

In [34]:
query5 = """
select customer.customer_id, min(rental.rental_date) over (partition by customer.customer_id) as first_rental_date, 
max(rental.rental_date) over (partition by customer.customer_id) as last_rental_date
from customer join rental on customer.customer_id = rental.customer_id
order by customer.customer_id;
"""

pd.read_sql_query(query5, engine)

       customer_id   first_rental_date    last_rental_date
0                1 2005-05-25 11:30:37 2005-08-22 20:03:46
1                1 2005-05-25 11:30:37 2005-08-22 20:03:46
2                1 2005-05-25 11:30:37 2005-08-22 20:03:46
3                1 2005-05-25 11:30:37 2005-08-22 20:03:46
4                1 2005-05-25 11:30:37 2005-08-22 20:03:46
...            ...                 ...                 ...
15639          599 2005-05-31 01:18:56 2005-08-23 11:25:00
15640          599 2005-05-31 01:18:56 2005-08-23 11:25:00
15641          599 2005-05-31 01:18:56 2005-08-23 11:25:00
15642          599 2005-05-31 01:18:56 2005-08-23 11:25:00
15643          599 2005-05-31 01:18:56 2005-08-23 11:25:00

[15644 rows x 3 columns]

#### Expected result

|customer_id|first_rental_date|last_rental_date   |
|-----------|-----------------|-------------------|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|

### 6. Calculate the rank of customers based on their rental counts:

```sql
-- Your code down below
SELECT...
```

#### Expected output

|customer_id|rental_count                 |rental_count_rank|
|-----------|-----------------------------|-----------------|
|148        |46                           |1                |
|526        |45                           |2                |
|144        |42                           |3                |
|236        |42                           |3                |
|75         |41                           |5                |
|197        |40                           |6                |
...|...|...

### 7. Calculate the running total of revenue per day for the 'G' film category:

```sql
-- Your code down below
SELECT...
```

#### Expected ouput

|film_category|rental_date                  |amount|daily_revenue|
|-------------|-----------------------------|------|-------------|
|BLANKET BEVERLY|2005-05-24 22:53:30          |2.99  |2.99         |
|GRADUATE LORD|2005-05-24 23:03:39          |3.99  |3.99         |
|LAWLESS VISION|2005-05-24 23:31:46          |4.99  |4.99         |
|HANGING DEEP |2005-05-25 00:02:21          |5.99  |5.99         |
|MONTEREY LABYRINTH|2005-05-25 00:31:15          |0.99  |0.99         |
|SCISSORHANDS SLUMS|2005-05-25 01:48:41          |2.99  |2.99         |
|EASY GLADIATOR|2005-05-25 03:41:50          |4.99  |4.99         |

### 8. Assign a unique ID to each payment within each customer's payment history:

```sql
-- Your code down below
SELECT...
```

|customer_id|payment_id|payment_sequence_id|
|-----------|----------|-------------------|
|1          |1         |1                  |
|1          |2         |2                  |
|1          |3         |3                  |
|1          |4         |4                  |
|1          |5         |5                  |
|1          |6         |6                  |
|1          |7         |7                  |
|1          |8         |8                  |
|1          |9         |9                  |
|1          |10        |10                 |
|1          |11        |11                 |
|1          |12        |12                 |
|1          |13        |13                 |
|1          |14        |14                 |
|1          |15        |15                 |
|1          |16        |16                 |
|1          |17        |17                 |
|1          |18        |18                 |
|1          |19        |19                 |
|1          |20        |20                 |
|1          |21        |21                 |
|1          |22        |22                 |
|1          |23        |23                 |
|1          |24        |24                 |
|1          |25        |25                 |
|1          |26        |26                 |
|1          |27        |27                 |
|1          |28        |28                 |
|1          |29        |29                 |
|1          |30        |30                 |
|1          |31        |31                 |
|1          |32        |32                 |
|2          |33        |1                  |
|2          |34        |2                  |
|2          |35        |3                  |
|2          |36        |4                  |
|2          |37        |5                  |
|2          |38        |6                  |
|2          |39        |7                  |
|2          |40        |8                  |
|2          |41        |9                  |
|2          |42        |10                 |
|2          |43        |11                 |
|2          |44        |12                 |

### 9. Calculate the difference in days between each rental and the previous rental for each customer:

```sql
-- Your code down below
SELECT...
```

#### Expected output


|customer_id|rental_id|rental_date        |previous_rental_date|days_between_rentals|
|-----------|---------|-------------------|--------------------|--------------------|
|1          |76       |2005-05-25 11:30:37|NULL                |NULL                |
|1          |573      |2005-05-28 10:35:23|2005-05-25 11:30:37 |3                   |
|1          |1185     |2005-06-15 00:54:12|2005-05-28 10:35:23 |18                  |
|1          |1422     |2005-06-15 18:02:53|2005-06-15 00:54:12 |0                   |
|1          |1476     |2005-06-15 21:08:46|2005-06-15 18:02:53 |0                   |
|1          |1725     |2005-06-16 15:18:57|2005-06-15 21:08:46 |1                   |
|1          |2308     |2005-06-18 08:41:48|2005-06-16 15:18:57 |2                   |
|1          |2363     |2005-06-18 13:33:59|2005-06-18 08:41:48 |0                   |
|1          |3284     |2005-06-21 06:24:45|2005-06-18 13:33:59 |3                   |
|1          |4526     |2005-07-08 03:17:05|2005-06-21 06:24:45 |17                  |
|1          |4611     |2005-07-08 07:33:56|2005-07-08 03:17:05 |0                   |